fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт оказания услуг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОказанияУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт оказания услуг'");
	КомандаПечати.Порядок = 5;
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОказанияУслуг");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаОказанияУслуг(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт оказания услуг'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанияУслуг";
	КонецЕсли;
		
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Функция ПечатьАктаОказанияУслуг(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОказанияУслуг";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОказанияУслуг");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиШапкуАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
	
		ВывестиТаблицуАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиПодвалАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиИсполнительАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиЗаказчикАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиЗаголовокАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	
	ОбластьЗаголовок.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер);
	ОбластьЗаголовок.Параметры.Дата = Формат(ДанныеДокументов.Дата, "ДФ=dd.MM.yyyy;");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиШапкуАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ОбластьШапка.Параметры.Организация = ДанныеДокументов.Организация;
	ОбластьШапка.Параметры.Контрагент = ДанныеДокументов.Контрагент;
	ОбластьШапка.Параметры.Договор = ДанныеДокументов.Договор;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиТаблицуАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьТаблица = Макет.ПолучитьОбласть("ОбластьТаблица");
	
	ВыборкаТабличнаяЧасть = ДанныеДокументов.Услуги.Выбрать();
	
	Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
		
		ОбластьТаблица.Параметры.НомерСтроки = ВыборкаТабличнаяЧасть.НомерСтроки;
		ОбластьТаблица.Параметры.Услуги = ВыборкаТабличнаяЧасть.Номенклатура;
		ОбластьТаблица.Параметры.Количество = ВыборкаТабличнаяЧасть.Количество;
		ОбластьТаблица.Параметры.Цена = ВыборкаТабличнаяЧасть.Цена;
		ОбластьТаблица.Параметры.Сумма = ВыборкаТабличнаяЧасть.Сумма;
		
		ТабличныйДокумент.Вывести(ОбластьТаблица);
		
	КонецЦикла;
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиПодвалАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ВыборкаТабличнаяЧасть = ДанныеДокументов.Услуги.Выбрать();
	ОбластьПодвал.Параметры.ЧислоНаименований = ВыборкаТабличнаяЧасть.Количество();
	СуммаИтого = 0;
	
	Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
		СуммаИтого = СуммаИтого + ВыборкаТабличнаяЧасть.Сумма;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.СуммаИтого = СуммаИтого;
	ОбластьПодвал.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтого, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиИсполнительАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьИсполнитель = Макет.ПолучитьОбласть("ОбластьИсполнитель");
	
	ОбластьИсполнитель.Параметры.Ответственный = ДанныеДокументов.Ответственный;
	
	ТабличныйДокумент.Вывести(ОбластьИсполнитель);
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Процедура ВывестиЗаказчикАктаОказанияУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаказчик = Макет.ПолучитьОбласть("ОбластьЗаказчик");
	
	ТабличныйДокумент.Вывести(ОбластьЗаказчик);
	
КонецПроцедуры
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

//{{ Коробов П.В. Задание: Заполнение Реализации товаров и услуг
Функция ПолучитьДанныеДокументов(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Ответственный КАК Ответственный,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции
//}} Коробов П.В. Задание: Заполнение Реализации товаров и услуг

#КонецОбласти

#КонецЕсли
